<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 1 to add, 1 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_firebase_project.default will be created
  + resource "google_firebase_project" "default" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "dungeon-studio-genshin-dev"
      + project_number = (known after apply)
    }

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
        id                         = "projects/dungeon-studio-genshin-dev/config"
        name                       = "projects/179636804167/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
</details>